// #############################################################################
// # File: screen.h                                                            #
// # Project: include                                                          #
// # Created Date: 2024/11/29 10:08:23                                         #
// # Author: realjf                                                            #
// # -----                                                                     #
// # Last Modified: 2024/11/29 10:22:09                                        #
// # Modified By: realjf                                                       #
// # -----                                                                     #
// #                                                                           #
// #############################################################################

#ifndef __SCREEN_H__
#define __SCREEN_H__

#include <curses.h>

//======================================标准窗口============================================

//======================================自定义窗口============================================

//======================================通用============================================
// 创建屏幕，结束屏幕需要调用shutdown()
SCREEN *new_term(const char *name, FILE *out, FILE *in);
// 删除屏幕
void delete_screen(SCREEN *sp);
// 设置并显示新屏幕，返回旧屏幕
SCREEN *show_term(SCREEN *sp);

#endif /* __SCREEN_H__ */
